In [1]:
# import pandas and Numpy

import pandas as pd
import numpy as np

## DataFrames are created  by python Lists and dictionaries
### Row Oriented 
### Column Oriented

## Row Oriented

In [3]:
sales = [{'account': 'Jones LLC', 'Jan': 150, 'Feb': 200, 'Mar': 140}, {'account': 'Alpha Co', 'Jan': 200, 'Feb': 210, 'Mar': 215}, {'account': 'Blue Inc', 'Jan': 50, 'Feb': 90, 'Mar': 95 }]
df =pd.DataFrame(sales)

In [4]:
df.head()

     account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95